---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotAlignSupportOnPosts
source: html/37b1ebdb-786b-94ba-b44b-6cdeee0d6506.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotAlignSupportOnPosts Property

Cannot align the support on the posts.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAlignSupportOnPosts { get; }
```